---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MEPConnectorInfo
source: html/1b8f80a0-8bac-8f24-783d-45e1df9c865d.htm
---
# MEPConnectorInfo Members

Releases all resources used by the MEPConnectorInfo